In [1]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['London', 'New York', 'Paris', 'Paris', 'Sydney'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

employees = pd.DataFrame(data)

In [2]:
print("Last 2 rows with the Name & Salary columns")
#different way:
print(employees.loc[3:4, ['Name', 'Salary']])

Last 2 rows with the Name & Salary columns
    Name  Salary
3  David   70000
4   Emma   65000

In [66]:
print("Data for employees with indices 0 to 2 & all columns using integer-based indexing:")
employees.iloc[3:5, 0::3]
#Alternative way
employees.iloc[3:5, [0, 3]]

Data for employees with indices 0 to 2 & all columns using integer-based indexing:

    Name  Salary
3  David   70000
4   Emma   65000

In [69]:
print("Boolean Indexing with employees aged 30 or above:")
employees[employees['Age'] >= 30]

Boolean Indexing with employees aged 30 or above:

      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
4     Emma   32    Sydney   65000